{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "1fd37d8a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix rdf4j: <http://rdf4j.org/schema/rdf4j#> .\n",
      "@prefix sesame: <http://www.openrdf.org/schema/sesame#> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "@prefix fn: <http://www.w3.org/2005/xpath-functions#> .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E56_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E56>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Language\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3382, _:node3383, _:node3384, _:node3385 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C20_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C20>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Entity Quality Type\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3387, _:node3388, _:node3389, _:node3390 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C13_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C13>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Geographical Place\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3430, _:node3431, _:node3432, _:node3433,\n",
      "    _:node3434, _:node3435, _:node3437, _:node3439 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E39_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E39>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Actor\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3458, _:node3459, _:node3460, _:node3461,\n",
      "    _:node3462, _:node3464, _:node3466 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C52_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C52>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Objects (physical)\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3633, _:node3634, _:node3635, _:node3636,\n",
      "    _:node3637, _:node3638, _:node3639, _:node3640, _:node3641, _:node3642, _:node3643,\n",
      "    _:node3645, _:node3647, _:node3649, _:node3651, _:node3653, _:node3655, _:node3657 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E33_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E33>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Description of  lot\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3659, _:node3660, _:node3661, _:node3662,\n",
      "    _:node3663, _:node3665 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C28_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C28>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3592, _:node3593, _:node3594, _:node3595,\n",
      "    _:node3596, _:node3597, _:node3599, _:node3601, _:node3603 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm-sup_C11_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/crm-supplement/C11>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Numeric Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3605, _:node3606, _:node3607, _:node3608,\n",
      "    _:node3609, _:node3611 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm-sup_C22_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/crm-supplement/C22>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Currency\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3392, _:node3393, _:node3394, _:node3395 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C53_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C53>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Object material & technique\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3441, _:node3442, _:node3443, _:node3444,\n",
      "    _:node3445 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E52_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E52>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Time Span\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3447, _:node3448, _:node3449, _:node3450,\n",
      "    _:node3451 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C4_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C4>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Object type\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3453, _:node3454, _:node3455, _:node3456 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E12_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E12>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Production\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3569, _:node3570, _:node3571, _:node3572,\n",
      "    _:node3573, _:node3574, _:node3575, _:node3577, _:node3579, _:node3581, _:node3583 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm-sup_C24_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/crm-supplement/C24>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Identifier Type\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3397, _:node3398, _:node3399 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C16_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C16>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Epistemic Location Type\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3401, _:node3402, _:node3403, _:node3404,\n",
      "    _:node3406 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C15_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C15>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Epistemic Location Of A Physical Thing\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3468, _:node3469, _:node3470, _:node3471,\n",
      "    _:node3472, _:node3473, _:node3474, _:node3475, _:node3477, _:node3479, _:node3481,\n",
      "    _:node3483, _:node3485 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E21_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E21>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Person\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3487, _:node3488, _:node3489, _:node3490,\n",
      "    _:node3491, _:node3493, _:node3495 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E42_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E42>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Identifier\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3517, _:node3518, _:node3519, _:node3520,\n",
      "    _:node3521, _:node3523 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh-slc_C14_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/social-life-core/C14>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Holding A Right Or Obligation\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3585, _:node3586, _:node3587, _:node3588,\n",
      "    _:node3590 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E24_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E24>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Catalogues\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3501, _:node3502, _:node3503, _:node3504,\n",
      "    _:node3505, _:node3506, _:node3507, _:node3509, _:node3511, _:node3513, _:node3515 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/frbroo_F2_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://www.iflastandards.info/fr/frbr/frbroo#F2>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Expression\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3525, _:node3526, _:node3527, _:node3528,\n",
      "    _:node3529, _:node3531, _:node3533 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/geov_C28_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://ontome.net/ontology/C28>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Mentioning\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3556, _:node3557, _:node3558, _:node3559,\n",
      "    _:node3560, _:node3561, _:node3563, _:node3565, _:node3567 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C57_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C57>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Quantifiable Quality Of A Spatio Temporal Phenomenon\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3408, _:node3409, _:node3410, _:node3411,\n",
      "    _:node3412, _:node3414, _:node3416 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh-slc_C2_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/social-life-core/C2>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Actor Social Quality\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3418, _:node3419, _:node3420 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm-sup_C3_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/crm-supplement/C3>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Activity Type\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3422, _:node3423, _:node3424 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh-slc_C9_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/social-life-core/C9>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Occupation Peit\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3497, _:node3498, _:node3499 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm_E7_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <http://www.cidoc-crm.org/cidoc-crm/E7>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Auction Sale\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3535, _:node3536, _:node3537, _:node3538,\n",
      "    _:node3539, _:node3540, _:node3541, _:node3542, _:node3543, _:node3544, _:node3546,\n",
      "    _:node3548, _:node3550, _:node3552, _:node3554 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh-slc_C15_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/social-life-core/C15>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Participation\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3613, _:node3614, _:node3615, _:node3616,\n",
      "    _:node3617, _:node3618, _:node3620, _:node3622, _:node3624 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh-slc_C8_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/social-life-core/C8>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Occupation Teen\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3626, _:node3627, _:node3628, _:node3629,\n",
      "    _:node3631 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C72_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C72>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Quantifiable Quality Of An Intentional Event Type\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3426, _:node3427, _:node3428 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C46_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C46>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Intentional Expression\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3667, _:node3668, _:node3669, _:node3670,\n",
      "    _:node3671, _:node3672, _:node3674, _:node3676, _:node3678 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh-slc_C37_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/social-life-core/C37>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Economic Transaction\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3680, _:node3681, _:node3682, _:node3683,\n",
      "    _:node3684, _:node3685, _:node3687, _:node3689, _:node3691 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/sdh_C71_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/core/C71>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Price\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3693, _:node3694, _:node3695, _:node3696,\n",
      "    _:node3697, _:node3699, _:node3701 .\n",
      "\n",
      "<https://sdhss.org/shacl/profiles/crm-sup_C21_shape> a <http://www.w3.org/ns/shacl#NodeShape>;\n",
      "  <http://www.w3.org/ns/shacl#targetClass> <https://sdhss.org/ontology/crm-supplement/C21>;\n",
      "  <http://www.w3.org/ns/shacl#name> \"Monetary Amount\";\n",
      "  <http://www.w3.org/ns/shacl#property> _:node3703, _:node3704, _:node3705, _:node3706,\n",
      "    _:node3707, _:node3709 .\n",
      "\n",
      "_:node3382 <http://www.w3.org/ns/shacl#name> \"Comment\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:comment;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3383 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3384 <http://www.w3.org/ns/shacl#name> \"Has Language\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P72>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E33> .\n",
      "\n",
      "_:node3385 <http://www.w3.org/ns/shacl#name> \"Has Language\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3386 .\n",
      "\n",
      "_:node3387 <http://www.w3.org/ns/shacl#name> \"Comment\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:comment;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3388 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3389 <http://www.w3.org/ns/shacl#name> \"Has Quality Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P23>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C28> .\n",
      "\n",
      "_:node3390 <http://www.w3.org/ns/shacl#name> \"Has Quality Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3391 .\n",
      "\n",
      "_:node3392 <http://www.w3.org/ns/shacl#name> \"Comment\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:comment;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3393 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3394 <http://www.w3.org/ns/shacl#name> \"Has Currency\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P16>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/crm-supplement/C21> .\n",
      "\n",
      "_:node3395 <http://www.w3.org/ns/shacl#name> \"Has Currency\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3396 .\n",
      "\n",
      "_:node3397 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3398 <http://www.w3.org/ns/shacl#name> \"Has Identifier Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P19>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E42> .\n",
      "\n",
      "_:node3399 <http://www.w3.org/ns/shacl#name> \"Has Identifier Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3400 .\n",
      "\n",
      "_:node3401 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3402 <http://www.w3.org/ns/shacl#name> \"Has Intentional Expression Identifing Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P48>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C15> .\n",
      "\n",
      "_:node3403 <http://www.w3.org/ns/shacl#name> \"Has Location Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P19>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C15> .\n",
      "\n",
      "_:node3404 <http://www.w3.org/ns/shacl#name> \"Has Intentional Expression Identifing Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3405 .\n",
      "\n",
      "_:node3406 <http://www.w3.org/ns/shacl#name> \"Has Location Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3407 .\n",
      "\n",
      "_:node3408 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3409 <http://www.w3.org/ns/shacl#name> \"Has Quality Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P23>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C57> .\n",
      "\n",
      "_:node3410 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P22>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E7> .\n",
      "\n",
      "_:node3411 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P35>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/crm-supplement/C11> .\n",
      "\n",
      "_:node3412 <http://www.w3.org/ns/shacl#name> \"Has Quality Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3413 .\n",
      "\n",
      "_:node3414 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3415 .\n",
      "\n",
      "_:node3416 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3417 .\n",
      "\n",
      "_:node3418 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3419 <http://www.w3.org/ns/shacl#name> \"Is Participation In The Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P12>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C15> .\n",
      "\n",
      "_:node3420 <http://www.w3.org/ns/shacl#name> \"Is Participation In The Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3421 .\n",
      "\n",
      "_:node3422 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3423 <http://www.w3.org/ns/shacl#name> \"Has Activity Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P9>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E7> .\n",
      "\n",
      "_:node3424 <http://www.w3.org/ns/shacl#name> \"Has Activity Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3425 .\n",
      "\n",
      "_:node3426 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3427 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality Of And Intentional Event Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P90>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C71> .\n",
      "\n",
      "_:node3428 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality Of And Intentional Event Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3429 .\n",
      "\n",
      "_:node3430 <http://www.w3.org/ns/shacl#name> \"Same As\";\n",
      "  <http://www.w3.org/ns/shacl#path> owl:sameAs;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3431 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3432 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P6>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E12> .\n",
      "\n",
      "_:node3433 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P6>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E7> .\n",
      "\n",
      "_:node3434 <http://www.w3.org/ns/shacl#name> \"Is Localized At\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P15>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C15> .\n",
      "\n",
      "_:node3435 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3436 .\n",
      "\n",
      "_:node3437 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3438 .\n",
      "\n",
      "_:node3439 <http://www.w3.org/ns/shacl#name> \"Is Localized At\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3440 .\n",
      "\n",
      "_:node3441 <http://www.w3.org/ns/shacl#name> \"Same As\";\n",
      "  <http://www.w3.org/ns/shacl#path> owl:sameAs;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3442 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3443 <http://www.w3.org/ns/shacl#name> \"Has Note\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P3>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3444 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Objects Produced With\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/human-activity/P20>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3445 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Objects Produced With\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3446 .\n",
      "\n",
      "_:node3447 <http://www.w3.org/ns/shacl#name> \"Begin Of The Begin\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P82a>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3448 <http://www.w3.org/ns/shacl#name> \"End Of The End\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P82b>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3449 <http://www.w3.org/ns/shacl#name> \"Has Note\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P3>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3450 <http://www.w3.org/ns/shacl#name> \"Has Time Span\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P4>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E12> .\n",
      "\n",
      "_:node3451 <http://www.w3.org/ns/shacl#name> \"Has Time Span\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3452 .\n",
      "\n",
      "_:node3453 <http://www.w3.org/ns/shacl#name> \"Same As\";\n",
      "  <http://www.w3.org/ns/shacl#path> owl:sameAs;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3454 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3455 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Object Of Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P66>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3456 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Object Of Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3457 .\n",
      "\n",
      "_:node3458 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3459 <http://www.w3.org/ns/shacl#name> \"Carried Out By\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P14>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E12> .\n",
      "\n",
      "_:node3460 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P17>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C15> .\n",
      "\n",
      "_:node3461 <http://www.w3.org/ns/shacl#name> \"Is Right Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P9>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C14> .\n",
      "\n",
      "_:node3462 <http://www.w3.org/ns/shacl#name> \"Carried Out By\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3463 .\n",
      "\n",
      "_:node3464 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3465 .\n",
      "\n",
      "_:node3466 <http://www.w3.org/ns/shacl#name> \"Is Right Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3467 .\n",
      "\n",
      "_:node3468 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3469 <http://www.w3.org/ns/shacl#name> \"Is Localized At\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P15>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C13> .\n",
      "\n",
      "_:node3470 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P17>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E39> .\n",
      "\n",
      "_:node3471 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P17>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E21> .\n",
      "\n",
      "_:node3472 <http://www.w3.org/ns/shacl#name> \"Has Intentional Expression Identifing Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P48>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C16> .\n",
      "\n",
      "_:node3473 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P17>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E24> .\n",
      "\n",
      "_:node3474 <http://www.w3.org/ns/shacl#name> \"Has Location Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P19>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C16> .\n",
      "\n",
      "_:node3475 <http://www.w3.org/ns/shacl#name> \"Is Localized At\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3476 .\n",
      "\n",
      "_:node3477 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3478 .\n",
      "\n",
      "_:node3479 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3480 .\n",
      "\n",
      "_:node3481 <http://www.w3.org/ns/shacl#name> \"Has Intentional Expression Identifing Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3482 .\n",
      "\n",
      "_:node3483 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3484 .\n",
      "\n",
      "_:node3485 <http://www.w3.org/ns/shacl#name> \"Has Location Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3486 .\n",
      "\n",
      "_:node3487 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3488 <http://www.w3.org/ns/shacl#name> \"Is Participation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P10>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C15> .\n",
      "\n",
      "_:node3489 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P17>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C15> .\n",
      "\n",
      "_:node3490 <http://www.w3.org/ns/shacl#name> \"Is Occupation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P4>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C8> .\n",
      "\n",
      "_:node3491 <http://www.w3.org/ns/shacl#name> \"Is Participation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3492 .\n",
      "\n",
      "_:node3493 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3494 .\n",
      "\n",
      "_:node3495 <http://www.w3.org/ns/shacl#name> \"Is Occupation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3496 .\n",
      "\n",
      "_:node3497 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3498 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P5>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C8> .\n",
      "\n",
      "_:node3499 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3500 .\n",
      "\n",
      "_:node3501 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3502 <http://www.w3.org/ns/shacl#name> \"Same As External Identifier\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P20>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E42> .\n",
      "\n",
      "_:node3503 <http://www.w3.org/ns/shacl#name> \"Carries\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P128>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://www.iflastandards.info/fr/frbr/frbroo#F2> .\n",
      "\n",
      "_:node3504 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P17>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C15> .\n",
      "\n",
      "_:node3505 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P108>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E12> .\n",
      "\n",
      "_:node3506 <http://www.w3.org/ns/shacl#name> \"Is Subjection Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P8>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C14> .\n",
      "\n",
      "_:node3507 <http://www.w3.org/ns/shacl#name> \"Same As External Identifier\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3508 .\n",
      "\n",
      "_:node3509 <http://www.w3.org/ns/shacl#name> \"Carries\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3510 .\n",
      "\n",
      "_:node3511 <http://www.w3.org/ns/shacl#name> \"Is Location Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3512 .\n",
      "\n",
      "_:node3513 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3514 .\n",
      "\n",
      "_:node3515 <http://www.w3.org/ns/shacl#name> \"Is Subjection Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3516 .\n",
      "\n",
      "_:node3517 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3518 <http://www.w3.org/ns/shacl#name> \"Is Identified By\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P1>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3519 <http://www.w3.org/ns/shacl#name> \"Same As External Identifier\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P20>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E24> .\n",
      "\n",
      "_:node3520 <http://www.w3.org/ns/shacl#name> \"Has Identifier Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P19>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/crm-supplement/C24> .\n",
      "\n",
      "_:node3521 <http://www.w3.org/ns/shacl#name> \"Same As External Identifier\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3522 .\n",
      "\n",
      "_:node3523 <http://www.w3.org/ns/shacl#name> \"Has Identifier Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3524 .\n",
      "\n",
      "_:node3525 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3526 <http://www.w3.org/ns/shacl#name> \"Is Mentioned In\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P27>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://ontome.net/ontology/C28> .\n",
      "\n",
      "_:node3527 <http://www.w3.org/ns/shacl#name> \"Carries\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P128>;\n",
      "  <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E24> .\n",
      "\n",
      "_:node3528 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P22>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C28> .\n",
      "\n",
      "_:node3529 <http://www.w3.org/ns/shacl#name> \"Is Mentioned In\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3530 .\n",
      "\n",
      "_:node3531 <http://www.w3.org/ns/shacl#name> \"Carries\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3532 .\n",
      "\n",
      "_:node3533 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3534 .\n",
      "\n",
      "_:node3535 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3536 <http://www.w3.org/ns/shacl#name> \"Begin Of The Begin\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P82a>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3537 <http://www.w3.org/ns/shacl#name> \"End Of The End\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P82b>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3538 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P26>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://ontome.net/ontology/C28> .\n",
      "\n",
      "_:node3539 <http://www.w3.org/ns/shacl#name> \"Has Activity Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P9>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/crm-supplement/C3> .\n",
      "\n",
      "_:node3540 <http://www.w3.org/ns/shacl#name> \"Is Part Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P5>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C46> .\n",
      "\n",
      "_:node3541 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P22>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C57> .\n",
      "\n",
      "_:node3542 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P6>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C13> .\n",
      "\n",
      "_:node3543 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P11>;\n",
      "  <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C15> .\n",
      "\n",
      "_:node3544 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3545 .\n",
      "\n",
      "_:node3546 <http://www.w3.org/ns/shacl#name> \"Has Activity Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3547 .\n",
      "\n",
      "_:node3548 <http://www.w3.org/ns/shacl#name> \"Is Part Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3549 .\n",
      "\n",
      "_:node3550 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3551 .\n",
      "\n",
      "_:node3552 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3553 .\n",
      "\n",
      "_:node3554 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3555 .\n",
      "\n",
      "_:node3556 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3557 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3558 <http://www.w3.org/ns/shacl#name> \"Is Mentioned In\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P27> .\n",
      "\n",
      "_:node3559 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3560 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3561 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3562 .\n",
      "\n",
      "_:node3563 <http://www.w3.org/ns/shacl#name> \"Is Mentioned In\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3564 .\n",
      "\n",
      "_:node3565 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3566 .\n",
      "\n",
      "_:node3567 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3568 .\n",
      "\n",
      "_:node3569 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3570 <http://www.w3.org/ns/shacl#name> \"Carried Out By\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P14> .\n",
      "\n",
      "_:node3571 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P108> .\n",
      "\n",
      "_:node3572 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P6> .\n",
      "\n",
      "_:node3573 <http://www.w3.org/ns/shacl#name> \"Has Time Span\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P4> .\n",
      "\n",
      "_:node3574 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P108> .\n",
      "\n",
      "_:node3575 <http://www.w3.org/ns/shacl#name> \"Carried Out By\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3576 .\n",
      "\n",
      "_:node3577 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3578 .\n",
      "\n",
      "_:node3579 <http://www.w3.org/ns/shacl#name> \"Took Place At\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3580 .\n",
      "\n",
      "_:node3581 <http://www.w3.org/ns/shacl#name> \"Has Time Span\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3582 .\n",
      "\n",
      "_:node3583 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3584 .\n",
      "\n",
      "_:node3585 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3586 <http://www.w3.org/ns/shacl#name> \"Is Subjection Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P8> .\n",
      "\n",
      "_:node3587 <http://www.w3.org/ns/shacl#name> \"Is Right Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P9> .\n",
      "\n",
      "_:node3588 <http://www.w3.org/ns/shacl#name> \"Is Subjection Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3589 .\n",
      "\n",
      "_:node3590 <http://www.w3.org/ns/shacl#name> \"Is Right Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3591 .\n",
      "\n",
      "_:node3592 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3593 <http://www.w3.org/ns/shacl#name> \"Has Quality Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P23> .\n",
      "\n",
      "_:node3594 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3595 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3596 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3597 <http://www.w3.org/ns/shacl#name> \"Has Quality Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3598 .\n",
      "\n",
      "_:node3599 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3600 .\n",
      "\n",
      "_:node3601 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3602 .\n",
      "\n",
      "_:node3603 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3604 .\n",
      "\n",
      "_:node3605 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3606 <http://www.w3.org/ns/shacl#name> \"Has Value\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P90>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3607 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3608 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3609 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3610 .\n",
      "\n",
      "_:node3611 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3612 .\n",
      "\n",
      "_:node3613 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3614 <http://www.w3.org/ns/shacl#name> \"Is Participation In The Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P12> .\n",
      "\n",
      "_:node3615 <http://www.w3.org/ns/shacl#name> \"Is Participation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P10> .\n",
      "\n",
      "_:node3616 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P11> .\n",
      "\n",
      "_:node3617 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P11> .\n",
      "\n",
      "_:node3618 <http://www.w3.org/ns/shacl#name> \"Is Participation In The Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3619 .\n",
      "\n",
      "_:node3620 <http://www.w3.org/ns/shacl#name> \"Is Participation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3621 .\n",
      "\n",
      "_:node3622 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3623 .\n",
      "\n",
      "_:node3624 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3625 .\n",
      "\n",
      "_:node3626 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3627 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P5> .\n",
      "\n",
      "_:node3628 <http://www.w3.org/ns/shacl#name> \"Is Occupation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P4> .\n",
      "\n",
      "_:node3629 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3630 .\n",
      "\n",
      "_:node3631 <http://www.w3.org/ns/shacl#name> \"Is Occupation Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3632 .\n",
      "\n",
      "_:node3633 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3634 <http://www.w3.org/ns/shacl#name> \"Is Identified By\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P1>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3635 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3636 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P5> .\n",
      "\n",
      "_:node3637 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3638 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P108> .\n",
      "\n",
      "_:node3639 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Object Of Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P66> .\n",
      "\n",
      "_:node3640 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Objects Produced With\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/human-activity/P20> .\n",
      "\n",
      "_:node3641 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3642 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3643 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3644 .\n",
      "\n",
      "_:node3645 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3646 .\n",
      "\n",
      "_:node3647 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3648 .\n",
      "\n",
      "_:node3649 <http://www.w3.org/ns/shacl#name> \"Has Produced\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3650 .\n",
      "\n",
      "_:node3651 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Object Of Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3652 .\n",
      "\n",
      "_:node3653 <http://www.w3.org/ns/shacl#name> \"Was Or Is Composed Of Objects Produced With\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3654 .\n",
      "\n",
      "_:node3655 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3656 .\n",
      "\n",
      "_:node3657 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3658 .\n",
      "\n",
      "_:node3659 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3660 <http://www.w3.org/ns/shacl#name> \"Has Symbolic Content\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P190>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3661 <http://www.w3.org/ns/shacl#name> \"Has Language\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P72> .\n",
      "\n",
      "_:node3662 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P5> .\n",
      "\n",
      "_:node3663 <http://www.w3.org/ns/shacl#name> \"Has Language\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3664 .\n",
      "\n",
      "_:node3665 <http://www.w3.org/ns/shacl#name> \"Is About\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3666 .\n",
      "\n",
      "_:node3667 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3668 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3669 <http://www.w3.org/ns/shacl#name> \"Is Part Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P5> .\n",
      "\n",
      "_:node3670 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3671 <http://www.w3.org/ns/shacl#name> \"Has Setting\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P43> .\n",
      "\n",
      "_:node3672 <http://www.w3.org/ns/shacl#name> \"Mentions\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3673 .\n",
      "\n",
      "_:node3674 <http://www.w3.org/ns/shacl#name> \"Is Part Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3675 .\n",
      "\n",
      "_:node3676 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3677 .\n",
      "\n",
      "_:node3678 <http://www.w3.org/ns/shacl#name> \"Has Setting\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3679 .\n",
      "\n",
      "_:node3680 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3681 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/social-life-core/P11> .\n",
      "\n",
      "_:node3682 <http://www.w3.org/ns/shacl#name> \"Has Setting\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P43> .\n",
      "\n",
      "_:node3683 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3684 <http://www.w3.org/ns/shacl#name> \"Is Quantifiable Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P89> .\n",
      "\n",
      "_:node3685 <http://www.w3.org/ns/shacl#name> \"Is Participation In\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3686 .\n",
      "\n",
      "_:node3687 <http://www.w3.org/ns/shacl#name> \"Has Setting\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3688 .\n",
      "\n",
      "_:node3689 <http://www.w3.org/ns/shacl#name> \"Occured In The Presence Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3690 .\n",
      "\n",
      "_:node3691 <http://www.w3.org/ns/shacl#name> \"Is Quantifiable Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3692 .\n",
      "\n",
      "_:node3693 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3694 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3695 <http://www.w3.org/ns/shacl#name> \"Is Quantifiable Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P89> .\n",
      "\n",
      "_:node3696 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality Of And Intentional Event Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P90> .\n",
      "\n",
      "_:node3697 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3698 .\n",
      "\n",
      "_:node3699 <http://www.w3.org/ns/shacl#name> \"Is Quantifiable Quality Of\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3700 .\n",
      "\n",
      "_:node3701 <http://www.w3.org/ns/shacl#name> \"Has Quantifiable Quality Of And Intentional Event Type\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3702 .\n",
      "\n",
      "_:node3703 <http://www.w3.org/ns/shacl#name> \"Label\";\n",
      "  <http://www.w3.org/ns/shacl#path> rdfs:label;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3704 <http://www.w3.org/ns/shacl#name> \"Has Value\";\n",
      "  <http://www.w3.org/ns/shacl#path> <http://www.cidoc-crm.org/cidoc-crm/P90>;\n",
      "  <http://www.w3.org/ns/shacl#datatype> xsd:string .\n",
      "\n",
      "_:node3705 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3706 <http://www.w3.org/ns/shacl#name> \"Has Currency\";\n",
      "  <http://www.w3.org/ns/shacl#path> <https://sdhss.org/ontology/crm-supplement/P16> .\n",
      "\n",
      "_:node3707 <http://www.w3.org/ns/shacl#name> \"Has Quality Dimension\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3708 .\n",
      "\n",
      "_:node3709 <http://www.w3.org/ns/shacl#name> \"Has Currency\";\n",
      "  <http://www.w3.org/ns/shacl#path> _:node3710 .\n",
      "\n",
      "_:node3386 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P72> .\n",
      "\n",
      "_:node3391 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P23> .\n",
      "\n",
      "_:node3396 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P16> .\n",
      "\n",
      "_:node3400 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P19> .\n",
      "\n",
      "_:node3405 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P48> .\n",
      "\n",
      "_:node3407 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P19> .\n",
      "\n",
      "_:node3413 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P23> .\n",
      "\n",
      "_:node3415 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3417 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3421 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P12> .\n",
      "\n",
      "_:node3425 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P9> .\n",
      "\n",
      "_:node3429 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P90> .\n",
      "\n",
      "_:node3436 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P6> .\n",
      "\n",
      "_:node3438 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P6> .\n",
      "\n",
      "_:node3440 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P15> .\n",
      "\n",
      "_:node3446 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/human-activity/P20> .\n",
      "\n",
      "_:node3452 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P4> .\n",
      "\n",
      "_:node3457 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P66> .\n",
      "\n",
      "_:node3463 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P14> .\n",
      "\n",
      "_:node3465 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P17> .\n",
      "\n",
      "_:node3467 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P9> .\n",
      "\n",
      "_:node3476 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P15> .\n",
      "\n",
      "_:node3478 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P17> .\n",
      "\n",
      "_:node3480 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P17> .\n",
      "\n",
      "_:node3482 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P48> .\n",
      "\n",
      "_:node3484 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P17> .\n",
      "\n",
      "_:node3486 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P19> .\n",
      "\n",
      "_:node3492 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P10> .\n",
      "\n",
      "_:node3494 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P17> .\n",
      "\n",
      "_:node3496 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P4> .\n",
      "\n",
      "_:node3500 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P5> .\n",
      "\n",
      "_:node3508 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P20> .\n",
      "\n",
      "_:node3510 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P128> .\n",
      "\n",
      "_:node3512 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P17> .\n",
      "\n",
      "_:node3514 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P108> .\n",
      "\n",
      "_:node3516 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P8> .\n",
      "\n",
      "_:node3522 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P20> .\n",
      "\n",
      "_:node3524 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P19> .\n",
      "\n",
      "_:node3530 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P27> .\n",
      "\n",
      "_:node3532 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P128> .\n",
      "\n",
      "_:node3534 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3545 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3547 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P9> .\n",
      "\n",
      "_:node3549 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P5> .\n",
      "\n",
      "_:node3551 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3553 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P6> .\n",
      "\n",
      "_:node3555 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P11> .\n",
      "\n",
      "_:node3562 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3564 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P27> .\n",
      "\n",
      "_:node3566 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3568 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3576 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P14> .\n",
      "\n",
      "_:node3578 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P108> .\n",
      "\n",
      "_:node3580 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P6> .\n",
      "\n",
      "_:node3582 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P4> .\n",
      "\n",
      "_:node3584 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P108> .\n",
      "\n",
      "_:node3589 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P8> .\n",
      "\n",
      "_:node3591 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P9> .\n",
      "\n",
      "_:node3598 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P23> .\n",
      "\n",
      "_:node3600 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3602 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3604 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3610 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3612 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3619 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P12> .\n",
      "\n",
      "_:node3621 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P10> .\n",
      "\n",
      "_:node3623 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P11> .\n",
      "\n",
      "_:node3625 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P11> .\n",
      "\n",
      "_:node3630 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P5> .\n",
      "\n",
      "_:node3632 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P4> .\n",
      "\n",
      "_:node3644 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P22> .\n",
      "\n",
      "_:node3646 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P5> .\n",
      "\n",
      "_:node3648 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3650 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P108> .\n",
      "\n",
      "_:node3652 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P66> .\n",
      "\n",
      "_:node3654 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/human-activity/P20> .\n",
      "\n",
      "_:node3656 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3658 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3664 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P72> .\n",
      "\n",
      "_:node3666 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P5> .\n",
      "\n",
      "_:node3673 <http://www.w3.org/ns/shacl#inversePath> <https://ontome.net/ontology/P26> .\n",
      "\n",
      "_:node3675 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P5> .\n",
      "\n",
      "_:node3677 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3679 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P43> .\n",
      "\n",
      "_:node3686 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/social-life-core/P11> .\n",
      "\n",
      "_:node3688 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P43> .\n",
      "\n",
      "_:node3690 <http://www.w3.org/ns/shacl#inversePath> <http://www.cidoc-crm.org/cidoc-crm/P12> .\n",
      "\n",
      "_:node3692 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P89> .\n",
      "\n",
      "_:node3698 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3700 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P89> .\n",
      "\n",
      "_:node3702 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P90> .\n",
      "\n",
      "_:node3708 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/core/P35> .\n",
      "\n",
      "_:node3710 <http://www.w3.org/ns/shacl#inversePath> <https://sdhss.org/ontology/crm-supplement/P16> .\n",
      "\n",
      "_:node3557 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E7> .\n",
      "\n",
      "_:node3558 <http://www.w3.org/ns/shacl#class> <https://www.iflastandards.info/fr/frbr/frbroo#F2> .\n",
      "\n",
      "_:node3559 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3560 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C46> .\n",
      "\n",
      "_:node3570 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E39> .\n",
      "\n",
      "_:node3571 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E24> .\n",
      "\n",
      "_:node3572 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C13> .\n",
      "\n",
      "_:node3573 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E52> .\n",
      "\n",
      "_:node3574 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3586 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E24> .\n",
      "\n",
      "_:node3587 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E39> .\n",
      "\n",
      "_:node3593 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C20> .\n",
      "\n",
      "_:node3594 <http://www.w3.org/ns/shacl#class> <https://www.iflastandards.info/fr/frbr/frbroo#F2> .\n",
      "\n",
      "_:node3595 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/crm-supplement/C11> .\n",
      "\n",
      "_:node3596 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3607 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C28> .\n",
      "\n",
      "_:node3608 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C57> .\n",
      "\n",
      "_:node3614 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C2> .\n",
      "\n",
      "_:node3615 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E21> .\n",
      "\n",
      "_:node3616 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E7> .\n",
      "\n",
      "_:node3617 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C37> .\n",
      "\n",
      "_:node3627 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C9> .\n",
      "\n",
      "_:node3628 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E21> .\n",
      "\n",
      "_:node3635 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C28> .\n",
      "\n",
      "_:node3636 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E33> .\n",
      "\n",
      "_:node3637 <http://www.w3.org/ns/shacl#class> <https://ontome.net/ontology/C28> .\n",
      "\n",
      "_:node3638 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E12> .\n",
      "\n",
      "_:node3639 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C4> .\n",
      "\n",
      "_:node3640 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C53> .\n",
      "\n",
      "_:node3641 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C46> .\n",
      "\n",
      "_:node3642 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C37> .\n",
      "\n",
      "_:node3661 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E56> .\n",
      "\n",
      "_:node3662 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3668 <http://www.w3.org/ns/shacl#class> <https://ontome.net/ontology/C28> .\n",
      "\n",
      "_:node3669 <http://www.w3.org/ns/shacl#class> <http://www.cidoc-crm.org/cidoc-crm/E7> .\n",
      "\n",
      "_:node3670 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3671 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C37> .\n",
      "\n",
      "_:node3681 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C15> .\n",
      "\n",
      "_:node3682 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C46> .\n",
      "\n",
      "_:node3683 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C52> .\n",
      "\n",
      "_:node3684 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C71> .\n",
      "\n",
      "_:node3694 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/crm-supplement/C21> .\n",
      "\n",
      "_:node3695 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/social-life-core/C37> .\n",
      "\n",
      "_:node3696 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C72> .\n",
      "\n",
      "_:node3705 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/core/C71> .\n",
      "\n",
      "_:node3706 <http://www.w3.org/ns/shacl#class> <https://sdhss.org/ontology/crm-supplement/C22> .\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "endpoint = \"https://graphdb.geovistory.org/repositories/OBJECTive\"\n",
    "\n",
    "query = \"\"\"\n",
    "CONSTRUCT {\n",
    "    ?s ?p ?o .\n",
    "}\n",
    "WHERE {\n",
    "    graph <http://geovistory.org/resource/shacl> { \n",
    "        ?s ?p ?o .\n",
    "    }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "headers = {\n",
    "    \"Content-Type\": \"application/sparql-query\",\n",
    "    \"Accept\": \"text/turtle\"   # or application/ld+json, application/rdf+xml\n",
    "}\n",
    "\n",
    "resp = requests.post(endpoint, data=query.encode(\"utf-8\"), headers=headers)\n",
    "\n",
    "if resp.status_code == 200:\n",
    "    print(resp.text)   # RDF data in Turtle\n",
    "else:\n",
    "    print(\"Error:\", resp.status_code, resp.text)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3406c569",
   "metadata": {},
   "source": [
    "# tools"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "328fec22",
   "metadata": {},
   "source": [
    "#### query.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "da631be7",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphly.tools.query import get_sparql_type\n",
    "\n",
    "select = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "SELECT ?city ?country\n",
    "WHERE {\n",
    "  ?city a dbo:City ;\n",
    "        dbo:country ?country .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "insert = \"\"\"\n",
    "PREFIX ex: <http://example.org/>\n",
    "INSERT DATA {\n",
    "  ex:Paris a ex:City ;\n",
    "           ex:country ex:France .\n",
    "}\n",
    "\"\"\"\n",
    "delete = \"\"\"\n",
    "PREFIX ex: <http://example.org/>\n",
    "DELETE DATA {\n",
    "  ex:Paris a ex:City ;\n",
    "           ex:country ex:France .\n",
    "}\n",
    "\"\"\"\n",
    "construct = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "CONSTRUCT {\n",
    "  ?city a dbo:City ;\n",
    "        dbo:country ?country .\n",
    "}\n",
    "WHERE {\n",
    "  ?city a dbo:City ;\n",
    "        dbo:country ?country .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "clear = \"\"\"\n",
    "PREFIX ex: <http://example.org/>\n",
    "CLEAR GRAPH <http://example.org/myGraph>\n",
    "\"\"\"\n",
    "\n",
    "assert get_sparql_type(select) == 'SELECT'\n",
    "assert get_sparql_type(insert) == 'INSERT'\n",
    "assert get_sparql_type(delete) == 'DELETE'\n",
    "assert get_sparql_type(construct) == 'CONSTRUCT'\n",
    "assert get_sparql_type(clear) == 'CLEAR'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cf4cecd0",
   "metadata": {},
   "source": [
    "#### triple.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "779c467c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphly.schema import Prefixes, Prefix\n",
    "from graphly.tools import prepare_triple\n",
    "\n",
    "prefixes = Prefixes([Prefix('base', 'http://example')])\n",
    "\n",
    "assert prepare_triple(('base:123', 'http://example/label', 'hello world'), prefixes.shorts()) == \"base:123 <http://example/label> 'hello world' .\"\n",
    "assert prepare_triple(('base:123', 'http://example/label', 3), prefixes.shorts()) == \"base:123 <http://example/label> 3 .\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "47ad350c",
   "metadata": {},
   "source": [
    "#### uri.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bbdf7abc",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphly.schema import Prefixes, Prefix, Resource\n",
    "from graphly.tools import prepare\n",
    "\n",
    "prefixes = Prefixes([Prefix('base', 'http://example')])\n",
    "\n",
    "assert prepare(None) == None\n",
    "assert prepare(3) == '3'\n",
    "assert prepare(\"3\") == \"'3'\"\n",
    "assert prepare(\"http://example\") == \"<http://example>\"\n",
    "assert prepare(\"base:hello\", prefixes.shorts()) == \"base:hello\"\n",
    "assert prepare(\"unknown:hello\", prefixes.shorts()) == \"'unknown:hello'\"\n",
    "\n",
    "r = Resource(\"test:123\", \"Name\")\n",
    "assert str(r) == 'test:123'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ec000cb2",
   "metadata": {},
   "source": [
    "# schema"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f239600f",
   "metadata": {},
   "source": [
    "#### prefix.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6cfdd963",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from graphly.schema import Prefix\n",
    "\n",
    "p = Prefix('short', 'long')\n",
    "\n",
    "ex = Prefix('ex', 'http://example.com/')\n",
    "\n",
    "assert ex.to_sparql() == \"PREFIX ex: <http://example.com/>\"\n",
    "assert ex.to_turtle() == \"@prefix ex: <http://example.com/> .\"\n",
    "assert ex.shorten(\"http://example.com/i123\") == \"ex:i123\"\n",
    "assert ex.lengthen(\"ex:i123\") == \"http://example.com/i123\"\n",
    "assert json.dumps(ex.to_dict()) == json.dumps(Prefix.from_dict(ex.to_dict()).to_dict())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "233da859",
   "metadata": {},
   "source": [
    "#### prefixes.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "609ac000",
   "metadata": {},
   "outputs": [],
   "source": [
    "ps = Prefixes()\n",
    "ps = Prefixes([Prefix('ex', 'http://example.com/')])\n",
    "assert ps.has('rdf') == False\n",
    "assert ps.has('ex') == True\n",
    "assert ps.shorten(\"http://example.com/i123\") == \"ex:i123\"\n",
    "assert ps.lengthen(\"ex:i123\") == \"http://example.com/i123\"\n",
    "\n",
    "test = Prefix('test', 'http://test.com/')\n",
    "ps.add(test)\n",
    "assert ps.has('test') == True\n",
    "assert ps.find('ex').short == 'ex'\n",
    "assert len(ps) == 2"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19884479",
   "metadata": {},
   "source": [
    "#### resource.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d9d38044",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from graphly.schema import Resource\n",
    "\n",
    "r0 = Resource(\"test\")\n",
    "\n",
    "r1 = Resource(\"A String\", class_uri=\"xsd:string\", resource_type='literal')\n",
    "assert r1.get_text() == \"A String\"\n",
    "assert r1.get_text(comment=True) == \"A String\"\n",
    "assert json.dumps(r1.to_dict()) == json.dumps(Resource.from_dict(r1.to_dict()).to_dict())\n",
    "\n",
    "\n",
    "r2 = Resource(3, class_uri=\"xsd:integer\", resource_type=\"literal\")\n",
    "assert r2.get_text() == \"3\"\n",
    "assert r2.get_text(comment=True) == \"3\"\n",
    "assert json.dumps(r2.to_dict()) == json.dumps(Resource.from_dict(r2.to_dict()).to_dict())\n",
    "\n",
    "r3 = Resource(\"base:i123\", \"Entity Label\", \"Entity comment\", class_uri=\"crm:E21\")\n",
    "assert r3.get_text() == \"Entity Label\"\n",
    "assert r3.get_text(comment=True) == \"Entity Label: Entity comment\"\n",
    "assert json.dumps(r3.to_dict()) == json.dumps(Resource.from_dict(r3.to_dict()).to_dict())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85f80378",
   "metadata": {},
   "source": [
    "#### property.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "43261892",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from graphly.schema import Resource, Property\n",
    "\n",
    "class1 = Resource(\"uri:class1\", \"Class1\")\n",
    "predicate = Resource(\"uri:predicate\", \"predicate name\", \"predicate comment\", \"owl:Property\")\n",
    "class2 = Resource(\"uri:class2\", \"Class2\")\n",
    "class3 = Resource(\"uri:class3\", \"Class3\")\n",
    "\n",
    "p0 = Property(\"uri:predicate\", \"predicate name\", \"predicate comment\")\n",
    "assert p0.get_key() == \"unknown-uri:predicate-unknown\"\n",
    "assert p0.is_mandatory() == False\n",
    "assert json.dumps(p0.to_dict()) == json.dumps(Property.from_dict(p0.to_dict()).to_dict())\n",
    "\n",
    "p1 = Property(\"uri:predicate\", \"predicate name\", \"predicate comment\", class1, class2, class3, 1, 0, 3)\n",
    "assert p1.get_key() == \"uri:class1-uri:predicate-uri:class2\"\n",
    "assert p1.is_mandatory() == False\n",
    "assert json.dumps(p1.to_dict()) == json.dumps(Property.from_dict(p1.to_dict()).to_dict())\n",
    "\n",
    "p2 = Property(\"uri:predicate\", \"predicate name\", \"predicate comment\", class1, None, class3, 1, 1, 3)\n",
    "assert p2.get_key() == \"uri:class1-uri:predicate-unknown\"\n",
    "assert p2.is_mandatory() == True\n",
    "assert json.dumps(p2.to_dict()) == json.dumps(Property.from_dict(p2.to_dict()).to_dict())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c9d57ef",
   "metadata": {},
   "source": [
    "#### statement.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1254a45f",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from graphly.schema import Resource, Property, Statement, Prefixes, Prefix\n",
    "\n",
    "prefixes = Prefixes([\n",
    "    Prefix('owl', 'http://example/owl'),\n",
    "    Prefix('crm', 'http://example/crm'),\n",
    "])\n",
    "\n",
    "c1 = Resource(\"http://example/person\", \"Person\", class_uri=\"owl:Class\")\n",
    "p1 = Resource(\"http://example/p1\", \"Person1\", class_uri=\"crm:E21\")\n",
    "p2 = Resource(\"http://example/p2\", \"Person2\", class_uri=\"crm:E21\")\n",
    "prop = Property(\"http://example/predicate1\", \"Predicate1\", \"\", c1, c1, c1)\n",
    "\n",
    "s0 = Statement(p1, prop, p2)\n",
    "assert json.dumps(s0.to_dict()) == json.dumps(Statement.from_dict(s0.to_dict()).to_dict())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85991e20",
   "metadata": {},
   "source": [
    "#### ontology.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "20fe6ab2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphly.schema import Ontology\n",
    "\n",
    "o = Ontology(\"My Ontology\", \"onto\", \"http://my-ontology.org/\")\n",
    "\n",
    "assert o.name == \"My Ontology\"\n",
    "assert o.prefix.short == \"onto\"\n",
    "assert o.prefix.long == \"http://my-ontology.org/\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "93870dac",
   "metadata": {},
   "source": [
    "#### sparql.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "503ec4ad",
   "metadata": {},
   "outputs": [],
   "source": [
    "# schema/sparql.py\n",
    "\n",
    "from graphly.schema import Sparql\n",
    "\n",
    "z = Sparql('url', 'user', 'password')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "87a7909f",
   "metadata": {},
   "source": [
    "# sparql"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "512fa648",
   "metadata": {},
   "source": [
    "#### allegrograph.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6151f267",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import dotenv\n",
    "dotenv.load_dotenv()\n",
    "from graphly.sparql import Allegrograph\n",
    "from graphly.schema import Prefix\n",
    "\n",
    "endpoint = Allegrograph(os.getenv('GRAPHLY_TEST_ALLEGROGRAPH_URL'), os.getenv('GRAPHLY_TEST_ALLEGROGRAPH_USERNAME'), os.getenv('GRAPHLY_TEST_ALLEGROGRAPH_PASSWORD'))\n",
    "endpoint.run('CLEAR ALL')\n",
    "\n",
    "endpoint.insert(('http://example/1', 'http://example/2', 'http://example/3'))\n",
    "result1 = endpoint.run('select * where { ?s ?p ?o . }')\n",
    "assert result1[0]['s'] == 'http://example/1'\n",
    "assert result1[0]['p'] == 'http://example/2'\n",
    "assert result1[0]['o'] == 'http://example/3'\n",
    "\n",
    "endpoint.delete(('http://example/1', 'http://example/2', 'http://example/3'))\n",
    "endpoint.insert(('http://example/1', 'http://example/2', 'http://example/4'))\n",
    "result2 = endpoint.run('select * where { ?s ?p ?o . }')\n",
    "assert result2[0]['s'] == 'http://example/1'\n",
    "assert result2[0]['p'] == 'http://example/2'\n",
    "assert result2[0]['o'] == 'http://example/4'\n",
    "\n",
    "endpoint.run('CLEAR ALL')\n",
    "n_quad = \"\"\"\n",
    "<http://example/10> <http://example/20> <http://example/30> .\n",
    "<http://example/40> <http://example/50> <http://example/60> <http://graph> .\n",
    "\"\"\"\n",
    "turtle = f\"\"\"\n",
    "{Prefix(\"test\", \"http://test/\").to_turtle()}\n",
    "test:123 test:456 test:789 .\n",
    "test:12 test:45 <http://example/78> .\n",
    "test:12 test:99 'hello world' .\n",
    "\"\"\"\n",
    "endpoint.upload_nquads(n_quad)\n",
    "endpoint.upload_turtle(turtle, 'http://graph/turtle')\n",
    "dump_lines = endpoint.dump().split('\\n')\n",
    "assert \"<http://example/10> <http://example/20> <http://example/30> .\" in dump_lines\n",
    "assert \"<http://example/40> <http://example/50> <http://example/60> <http://graph> .\" in dump_lines\n",
    "assert \"<http://test/123> <http://test/456> <http://test/789> <http://graph/turtle> .\" in dump_lines\n",
    "assert \"<http://test/12> <http://test/45> <http://example/78> <http://graph/turtle> .\" in dump_lines\n",
    "assert \"<http://test/12> <http://test/99> 'hello world' <http://graph/turtle> .\" in dump_lines or \\\n",
    "       '<http://test/12> <http://test/99> \"hello world\" <http://graph/turtle> .'\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6eba9421",
   "metadata": {},
   "source": [
    "#### fuseki.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "95aacd6d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import dotenv\n",
    "dotenv.load_dotenv()\n",
    "from graphly.sparql import Fuseki\n",
    "from graphly.schema import Prefix\n",
    "\n",
    "endpoint = Fuseki(os.getenv('GRAPHLY_TEST_FUSEKI_URL'), os.getenv('GRAPHLY_TEST_FUSEKI_USERNAME'), os.getenv('GRAPHLY_TEST_FUSEKI_PASSWORD'))\n",
    "endpoint.run('CLEAR ALL')\n",
    "\n",
    "endpoint.insert(('http://example/1', 'http://example/2', 'http://example/3'))\n",
    "result1 = endpoint.run('select * where { ?s ?p ?o . }')\n",
    "assert result1[0]['s'] == 'http://example/1'\n",
    "assert result1[0]['p'] == 'http://example/2'\n",
    "assert result1[0]['o'] == 'http://example/3'\n",
    "\n",
    "endpoint.delete(('http://example/1', 'http://example/2', 'http://example/3'))\n",
    "endpoint.insert(('http://example/1', 'http://example/2', 'http://example/4'))\n",
    "result2 = endpoint.run('select * where { ?s ?p ?o . }')\n",
    "assert result2[0]['s'] == 'http://example/1'\n",
    "assert result2[0]['p'] == 'http://example/2'\n",
    "assert result2[0]['o'] == 'http://example/4'\n",
    "\n",
    "endpoint.run('CLEAR ALL')\n",
    "n_quad = \"\"\"\n",
    "<http://example/10> <http://example/20> <http://example/30> .\n",
    "<http://example/40> <http://example/50> <http://example/60> <http://graph> .\n",
    "\"\"\"\n",
    "turtle = f\"\"\"\n",
    "{Prefix(\"test\", \"http://test/\").to_turtle()}\n",
    "test:123 test:456 test:789 .\n",
    "test:12 test:45 <http://example/78> .\n",
    "test:12 test:99 'hello world' .\n",
    "\"\"\"\n",
    "endpoint.upload_nquads(n_quad)\n",
    "endpoint.upload_turtle(turtle, 'http://graph/turtle')\n",
    "dump_lines = endpoint.dump().split('\\n')\n",
    "assert \"<http://example/10> <http://example/20> <http://example/30> .\" in dump_lines\n",
    "assert \"<http://example/40> <http://example/50> <http://example/60> <http://graph> .\" in dump_lines\n",
    "assert \"<http://test/123> <http://test/456> <http://test/789> <http://graph/turtle> .\" in dump_lines\n",
    "assert \"<http://test/12> <http://test/45> <http://example/78> <http://graph/turtle> .\" in dump_lines\n",
    "assert \"<http://test/12> <http://test/99> 'hello world' <http://graph/turtle> .\" in dump_lines\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "892cc6f9",
   "metadata": {},
   "source": [
    "#### graphdb.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c82584cb",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import dotenv\n",
    "dotenv.load_dotenv()\n",
    "from graphly.sparql import GraphDB\n",
    "from graphly.schema import Prefix\n",
    "\n",
    "endpoint = GraphDB(os.getenv('GRAPHLY_TEST_GRAPHDB_URL'), os.getenv('GRAPHLY_TEST_GRAPHDB_USERNAME'), os.getenv('GRAPHLY_TEST_GRAPHDB_PASSWORD'))\n",
    "endpoint.run('CLEAR ALL')\n",
    "\n",
    "endpoint.insert(('http://example/1', 'http://example/2', 'http://example/3'))\n",
    "result1 = endpoint.run('select * where { ?s ?p ?o . }')\n",
    "found = False\n",
    "for triple in result1:\n",
    "    if triple['s'] == 'http://example/1' and triple['p'] == 'http://example/2' and triple['o'] == 'http://example/3':\n",
    "        found = True\n",
    "        break\n",
    "assert found\n",
    "\n",
    "endpoint.delete(('http://example/1', 'http://example/2', 'http://example/3'))\n",
    "endpoint.insert(('http://example/1', 'http://example/2', 'http://example/4'))\n",
    "result2 = endpoint.run('select * where { ?s ?p ?o . }')\n",
    "found = False\n",
    "for triple in result2:\n",
    "    if triple['s'] == 'http://example/1' and triple['p'] == 'http://example/2' and triple['o'] == 'http://example/4':\n",
    "        found = True\n",
    "        break\n",
    "assert found\n",
    "\n",
    "endpoint.run('CLEAR ALL')\n",
    "n_quad = \"\"\"\n",
    "<http://example/10> <http://example/20> <http://example/30> .\n",
    "<http://example/40> <http://example/50> <http://example/60> <http://graph> .\n",
    "\"\"\"\n",
    "turtle = f\"\"\"\n",
    "{Prefix(\"test\", \"http://test/\").to_turtle()}\n",
    "test:123 test:456 test:789 .\n",
    "test:12 test:45 <http://example/78> .\n",
    "test:12 test:99 'hello world' .\n",
    "\"\"\"\n",
    "endpoint.upload_nquads(n_quad)\n",
    "endpoint.upload_turtle(turtle, 'http://graph/turtle')\n",
    "dump_lines = endpoint.dump().split('\\n')\n",
    "assert \"<http://example/10> <http://example/20> <http://example/30> .\" in dump_lines\n",
    "assert \"<http://example/40> <http://example/50> <http://example/60> <http://graph> .\" in dump_lines\n",
    "assert \"<http://test/123> <http://test/456> <http://test/789> <http://graph/turtle> .\" in dump_lines\n",
    "assert \"<http://test/12> <http://test/45> <http://example/78> <http://graph/turtle> .\" in dump_lines\n",
    "assert \"<http://test/12> <http://test/99> 'hello world' <http://graph/turtle> .\" in dump_lines or \\\n",
    "       '<http://test/12> <http://test/99> \"hello world\" <http://graph/turtle> .'\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "86afea23",
   "metadata": {},
   "source": [
    "# schema"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d0b23913",
   "metadata": {},
   "source": [
    "#### graph.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4476d2c4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os import getenv\n",
    "from dotenv import load_dotenv\n",
    "from graphly.schema import Graph, Prefix, Prefixes\n",
    "from graphly.sparql import Fuseki\n",
    "load_dotenv()\n",
    "\n",
    "prefix = Prefix('test', 'http://example.com/')\n",
    "prefixes = Prefixes([prefix])\n",
    "sparql = Fuseki(getenv('GRAPHLY_TEST_FUSEKI_URL'), getenv('GRAPHLY_TEST_FUSEKI_USERNAME'), getenv('GRAPHLY_TEST_FUSEKI_PASSWORD'))\n",
    "\n",
    "g = Graph(sparql)\n",
    "\n",
    "assert g.sparql_begin == ''\n",
    "assert g.sparql_end == ''\n",
    "\n",
    "g.run('CLEAR ALL')\n",
    "triples = [(\"test:i1\", \"test:p1\", \"http://example.com/i2\"), (\"test:i1\", \"test:p2\", \"http://example.com/i3\")]\n",
    "g.insert(triples, prefixes)\n",
    "g.delete((\"test:i1\", \"test:p1\", \"?o\"), prefixes)    \n",
    "result = g.run('select ?s ?p ?o where { ?s ?p ?o .}')\n",
    "assert len(result) == 1\n",
    "assert result[0]['o'] == 'http://example.com/i3'\n",
    "\n",
    "result = g.dump_dict(prefixes)\n",
    "assert len(result) == 1\n",
    "assert result[0]['o'] == 'test:i3'\n",
    "\n",
    "result = g.dump_turtle(prefixes)\n",
    "assert result.endswith('test:i1 test:p2 test:i3 .\\n')\n",
    "\n",
    "result = g.dump_nquad(prefixes)\n",
    "assert result == \"<http://example.com/i1> <http://example.com/p2> <http://example.com/i3> .\\n\"\n",
    "\n",
    "g.run('CLEAR ALL')\n",
    "turtle = \"\"\"\n",
    "@prefix test: <http://example.com/>. \n",
    "\n",
    "test:e1 test:p1 test:e2;\n",
    "        test:p2 test:e3;\n",
    "\"\"\"\n",
    "g.upload_turtle(turtle)\n",
    "result = g.dump_dict(prefixes)\n",
    "assert len(result) == 2\n",
    "assert result[0]['o'] == 'test:e3'\n",
    "assert result[0]['p'] == 'test:p2'\n",
    "assert result[1]['o'] == 'test:e2'\n",
    "assert result[1]['p'] == 'test:p1'\n",
    "\n",
    "\n",
    "\n",
    "g = Graph(sparql, \"test:graph\", prefixes)\n",
    "\n",
    "assert g.sparql_begin == 'GRAPH test:graph {'\n",
    "assert g.sparql_end == '}'\n",
    "g.run('CLEAR ALL', prefixes)\n",
    "triples = [(\"test:i1\", \"test:p1\", \"http://example.com/i2\"), (\"test:i1\", \"test:p2\", \"http://example.com/i3\")]\n",
    "g.insert(triples, prefixes)\n",
    "g.delete((\"test:i1\", \"test:p1\", \"?o\"), prefixes)    \n",
    "result = g.run('select ?s ?p ?o where { graph test:graph { ?s ?p ?o .}}', prefixes)\n",
    "assert len(result) == 1\n",
    "assert result[0]['o'] == 'test:i3'\n",
    "\n",
    "result = g.dump_dict(prefixes)\n",
    "assert len(result) == 1\n",
    "assert result[0]['o'] == 'test:i3'\n",
    "\n",
    "result = g.dump_turtle(prefixes)\n",
    "assert result.endswith('test:i1 test:p2 test:i3 .\\n')\n",
    "\n",
    "result = g.dump_nquad(prefixes)\n",
    "assert result == \"<http://example.com/i1> <http://example.com/p2> <http://example.com/i3> <http://example.com/graph> .\\n\"\n",
    "\n",
    "g.run('CLEAR ALL')\n",
    "turtle = \"\"\"\n",
    "@prefix test: <http://example.com/>. \n",
    "\n",
    "test:e1 test:p1 test:e2;\n",
    "        test:p2 test:e3;\n",
    "\"\"\"\n",
    "g.upload_turtle(turtle)\n",
    "result = g.dump_dict(prefixes)\n",
    "assert len(result) == 2\n",
    "assert result[0]['o'] == 'test:e3'\n",
    "assert result[0]['p'] == 'test:p2'\n",
    "assert result[1]['o'] == 'test:e2'\n",
    "assert result[1]['p'] == 'test:p1'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f1938a24",
   "metadata": {},
   "source": [
    "#### model.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ee062db4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os import getenv\n",
    "from dotenv import load_dotenv\n",
    "from graphly.schema import Model, Graph, Prefix, Prefixes\n",
    "from graphly.sparql import Fuseki\n",
    "load_dotenv()\n",
    "\n",
    "prefix = Prefix('test', 'http://example.com/')\n",
    "prefixes = Prefixes([prefix])\n",
    "sparql = Fuseki(getenv('GRAPHLY_TEST_FUSEKI_URL'), getenv('GRAPHLY_TEST_FUSEKI_USERNAME'), getenv('GRAPHLY_TEST_FUSEKI_PASSWORD'))\n",
    "graph = Graph(sparql, '', prefixes)\n",
    "graph.run('CLEAR ALL', prefixes)\n",
    "triples = [\n",
    "    ('test:e1', 'test:p1', 'test:c1'),\n",
    "    ('test:c1', 'test:p2', 'Class1'),\n",
    "    ('test:e1', 'test:p2', 'E1 label'),\n",
    "    ('test:e1', 'test:p3', 'E1 Comment'),\n",
    "    ('test:e1', 'test:p4', 'Something'),\n",
    "]\n",
    "graph.insert(triples, prefixes)\n",
    "\n",
    "model = Model(type_property='test:p1', label_property='test:p2', comment_property='test:p3')\n",
    "model.update(graph, prefixes)\n",
    "\n",
    "assert model.classes[0].resource_type == 'iri'\n",
    "assert model.classes[0].uri == 'test:c1'\n",
    "assert model.classes[0].label == 'Class1'\n",
    "assert model.classes[0].class_uri == 'owl:Class'\n",
    "\n",
    "assert model.properties[0].domain.uri == \"test:c1\"\n",
    "assert model.properties[0].uri == \"test:p4\"\n",
    "assert model.properties[0].range.uri == \"xsd:string\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "036dd978",
   "metadata": {},
   "source": [
    "# models"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34363eb4",
   "metadata": {},
   "source": [
    "#### shacl.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "784532cd",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os import getenv, environ\n",
    "from dotenv import load_dotenv\n",
    "from graphly.models import SHACL\n",
    "from graphly.schema import Graph, Prefix, Prefixes\n",
    "from graphly.sparql import Fuseki\n",
    "load_dotenv()\n",
    "\n",
    "environ['GRAPHLY_MODE'] = 'normal'\n",
    "\n",
    "prefix_test = Prefix('test', 'http://example.com/')\n",
    "prefix_shacl = Prefix('sh', 'http://www.w3.org/ns/shacl#')\n",
    "prefix_xsd = Prefix('xsd', 'http://www.w3.org/2001/XMLSchema#')\n",
    "prefix_crm = Prefix('crm', 'http://www.cidoc-crm.org/cidoc-crm/')\n",
    "prefix_rdf = Prefix('rdf', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#')\n",
    "prefixes = Prefixes([prefix_test, prefix_shacl, prefix_crm, prefix_xsd, prefix_rdf])\n",
    "sparql = Fuseki(getenv('GRAPHLY_TEST_FUSEKI_URL'), getenv('GRAPHLY_TEST_FUSEKI_USERNAME'), getenv('GRAPHLY_TEST_FUSEKI_PASSWORD'))\n",
    "graph = Graph(sparql, 'test:shacl', prefixes)\n",
    "graph.run('CLEAR ALL', prefixes)\n",
    "\n",
    "shacl = \"\"\"\n",
    "@prefix sdh-shacl: <https://sdhss.org/shacl/profiles/>. \n",
    "@prefix sh: <http://www.w3.org/ns/shacl#> .  \n",
    "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
    "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
    "@prefix rdfs: \t<http://www.w3.org/2000/01/rdf-schema#> .  \n",
    "@prefix sdh-short: <https://sdhss.org/ontology/shortcuts/>.\n",
    "@prefix sdh: <https://sdhss.org/ontology/core/>.\n",
    "@prefix crm: <http://www.cidoc-crm.org/cidoc-crm/>. \n",
    "\n",
    "    sdh-shacl:crm_E21_Shape a sh:NodeShape ; \n",
    "        sh:targetClass crm:E21 ;\n",
    "        sh:name \"Person\" ;\n",
    "\n",
    "        sh:property [\n",
    "            sh:path rdfs:label ;\n",
    "            sh:name \"Label\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 1;\n",
    "            sh:minCount 1;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path rdfs:comment ;\n",
    "            sh:name \"Description\";\n",
    "            sh:datatype rdf:HTML;\n",
    "            sh:order 2;\n",
    "            sh:minCount 1;\n",
    "        ];  \n",
    "         \n",
    "        sh:property [\n",
    "            sh:path sdh-short:P2 ;\n",
    "            sh:name \"has birth date\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:maxCount 1;\n",
    "            sh:order 3; # verify what happens if new properties\n",
    "        ];                   \n",
    "        . \n",
    "\n",
    "    sdh-shacl:crm_E67_Shape a sh:NodeShape ;\n",
    "        sh:targetClass crm:E67 ;\n",
    "        sh:name \"Birth\" ;\n",
    "\n",
    "        sh:property [\n",
    "            sh:path rdfs:label ;\n",
    "            sh:name \"Label\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 1;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path rdfs:comment ;\n",
    "            sh:name \"Description\";\n",
    "            sh:datatype rdf:HTML;\n",
    "            sh:order 2;\n",
    "        ];  \n",
    "            \n",
    "        sh:property [\n",
    "            sh:path crm:P8 ;\n",
    "            sh:name \"took place on or within\";\n",
    "            sh:class sdh:C17 ;\n",
    "            sh:order 3;\n",
    "        ];\n",
    "                        \n",
    "        sh:property [\n",
    "            sh:path crm:P98 ;\n",
    "            sh:name \"brought into life\";\n",
    "            sh:class crm:E21 ;\n",
    "            sh:order 4;\n",
    "        ];\n",
    "                        \n",
    "        sh:property [\n",
    "            sh:path sdh:P6 ;\n",
    "            sh:name \"took place at\";\n",
    "            sh:class sdh:C13 ;\n",
    "            sh:order 5;\n",
    "        ];\n",
    "                    \n",
    "        sh:property [\n",
    "            sh:path sdh-short:P1 ;\n",
    "            sh:name \"at some time within\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 6;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path sdh-short:P4 ;\n",
    "            sh:name \"begins on\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 7;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path sdh-short:P7 ;\n",
    "            sh:name \"ends on\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 8;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path sdh-short:P3 ;\n",
    "            sh:name \"begins after\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 9;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path sdh-short:P5 ;\n",
    "            sh:name \"begins before\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 10;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path sdh-short:P6 ;\n",
    "            sh:name \"ends after\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 11;\n",
    "            sh:maxCount 1;\n",
    "        ];\n",
    "\n",
    "        sh:property [\n",
    "            sh:path sdh-short:P8 ;\n",
    "            sh:name \"ends before\";\n",
    "            sh:datatype xsd:string;\n",
    "            sh:order 12;\n",
    "            sh:maxCount 1;\n",
    "        ];   \n",
    "        . \n",
    "\"\"\"\n",
    "\n",
    "graph.upload_turtle(shacl)\n",
    "\n",
    "model_shacl = SHACL()\n",
    "model_shacl.update(graph, prefixes)\n",
    "\n",
    "classes_uris = [c.uri for c in model_shacl.classes]\n",
    "prop_uris = [p.uri for p in model_shacl.properties]\n",
    "\n",
    "assert 'crm:E21' in classes_uris\n",
    "assert 'crm:E67' in classes_uris\n",
    "assert 'xsd:string' in classes_uris\n",
    "assert 'rdf:HTML' in classes_uris\n",
    "\n",
    "assert 'crm:P8' in prop_uris\n",
    "assert 'crm:P98' in prop_uris\n",
    "assert 'https://sdhss.org/ontology/core/P6' in prop_uris\n",
    "\n",
    "crm_P98 = next(p for p in model_shacl.properties if p.uri == 'crm:P98')\n",
    "\n",
    "assert crm_P98.card_of.uri == 'crm:E67'\n",
    "assert crm_P98.domain.uri == 'crm:E67'\n",
    "assert crm_P98.range.uri == 'crm:E21'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fc6f43f7",
   "metadata": {},
   "source": [
    "# ontologies"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ce6b8004",
   "metadata": {},
   "source": [
    "#### crm.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3f9e51d7",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphly.ontologies import CRM\n",
    "\n",
    "assert CRM.E21_Person.uri == 'crm:E21'\n",
    "assert CRM.P98_Brought_Into_Life.uri == 'crm:P98'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c845de8d",
   "metadata": {},
   "source": [
    "#### sdh.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3e058fae",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphly.ontologies import SDH\n",
    "\n",
    "assert SDH.C13_Geographical_Place.uri == \"sdh:C13\"\n",
    "assert SDH.P6_Took_Place_At.uri == 'sdh:P6'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2583a7d9",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "da8f3886",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "==============\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX sh: <http://www.w3.org/ns/shacl#>\n",
      "PREFIX sdh: <https://sdhss.org/ontology/core/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "# SHACL.get_classes()\n",
      "SELECT DISTINCT\n",
      "    ?uri \n",
      "    (COALESCE(?label_, '') as ?label)\n",
      "WHERE {\n",
      "    GRAPH <http://geovistory.org/resource/shacl> {\n",
      "        ?node a sh:NodeShape .\n",
      "        ?node sh:name ?label_ .\n",
      "        ?node sh:targetClass ?uri .\n",
      "    }\n",
      "}\n",
      "==============\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX sh: <http://www.w3.org/ns/shacl#>\n",
      "PREFIX sdh: <https://sdhss.org/ontology/core/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "# SHACL.get_properties()\n",
      "SELECT DISTINCT\n",
      "    (COALESCE(?target_class_, '') as ?card_of_class_uri)\n",
      "    (COALESCE(?label_, ?uri) as ?label)\n",
      "    (COALESCE(?order_, '') as ?order)\n",
      "    (COALESCE(?min_count_, '') as ?min_count)\n",
      "    (COALESCE(?max_count_, '') as ?max_count)\n",
      "    (COALESCE(?domain_class_uri_, '') as ?domain_class_uri)\n",
      "    ?uri\n",
      "    (COALESCE(?range_class_uri_, ?datatype_, '') as ?range_class_uri)\n",
      "WHERE {\n",
      "    GRAPH <http://geovistory.org/resource/shacl> {               \n",
      "        ?shape sh:property ?node .\n",
      "        ?node sh:path ?supposed_uri .  \n",
      "        OPTIONAL { ?shape sh:targetClass ?target_class_ . }\n",
      "        OPTIONAL { ?supposed_uri sh:inversePath ?inverse_property_uri . }\n",
      "        OPTIONAL { ?node sh:name ?label_ . }\n",
      "        OPTIONAL { ?node sh:order ?order_ . }\n",
      "        OPTIONAL { ?node sh:minCount ?min_count_ . }\n",
      "        OPTIONAL { ?node sh:maxCount ?max_count_ . }\n",
      "        OPTIONAL { ?node sh:datatype ?datatype_ . }\n",
      "        OPTIONAL { ?node sh:class ?class . }\n",
      "        BIND(IF(isBlank(?supposed_uri), '', ?target_class_) as ?domain_class_uri_)\n",
      "        BIND(IF(isBlank(?supposed_uri), ?target_class_, ?class) as ?range_class_uri_)\n",
      "        BIND(IF(isBlank(?supposed_uri), ?inverse_property_uri, ?supposed_uri) as ?uri)\n",
      "    }\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "from graphly.schema import Prefix, Prefixes, Graph\n",
    "from graphly.sparql import GraphDB\n",
    "from graphly.models import SHACL\n",
    "\n",
    "os.environ['GRAPHLY_MODE'] = 'debug'\n",
    "\n",
    "# Needed information to connect to the endpoint\n",
    "url = \"https://graphdb.geovistory.org/repositories/OBJECTive\"\n",
    "username = \"admin\"\n",
    "password = \"OqZcv*zTw9urJ&XtcNdx\"\n",
    "\n",
    "prefixes = Prefixes([\n",
    "    Prefix('rdf', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#'),\n",
    "    Prefix('rdfs', 'http://www.w3.org/2000/01/rdf-schema#'),\n",
    "    Prefix('sh', 'http://www.w3.org/ns/shacl#'),\n",
    "    Prefix('sdh', 'https://sdhss.org/ontology/core/'),\n",
    "    Prefix('xsd', 'http://www.w3.org/2001/XMLSchema#'),\n",
    "    Prefix('crm', 'http://www.cidoc-crm.org/cidoc-crm/'),\n",
    "    Prefix('owl', 'http://www.w3.org/2002/07/owl#')\n",
    "])\n",
    "\n",
    "\n",
    "prefixes = prefixes\n",
    "\n",
    "# Get the right SPARQL technology\n",
    "endpoint = GraphDB(url, username, password)\n",
    "\n",
    "# Get the right model class\n",
    "model = SHACL()\n",
    "\n",
    "# Set all the needed graphs\n",
    "graph_data = Graph(endpoint, \"\", prefixes)\n",
    "graph_model = Graph(endpoint, \"http://geovistory.org/resource/shacl\", prefixes)\n",
    "graph_metadata = Graph(endpoint, \"\", prefixes)\n",
    "\n",
    "# Fetch the Model\n",
    "model.update(graph_model, prefixes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "1648e1ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "==============\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX sh: <http://www.w3.org/ns/shacl#>\n",
      "PREFIX sdh: <https://sdhss.org/ontology/core/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "# graphly.schema.graph.dump\n",
      "SELECT \n",
      "    ?s ?p ?o \n",
      "    ?s_is_blank ?o_is_blank\n",
      "WHERE { \n",
      "    GRAPH <http://geovistory.org/resource/shacl> { \n",
      "        ?s ?p ?o . \n",
      "        BIND(isBlank(?s) as ?s_is_blank)\n",
      "        BIND(isBlank(?o) as ?o_is_blank)\n",
      "    } \n",
      "}\n",
      "LIMIT 5000\n",
      "OFFSET 0\n",
      "==============\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX sh: <http://www.w3.org/ns/shacl#>\n",
      "PREFIX sdh: <https://sdhss.org/ontology/core/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "# graphly.schema.graph.dump\n",
      "SELECT \n",
      "    ?s ?p ?o \n",
      "    ?s_is_blank ?o_is_blank\n",
      "WHERE { \n",
      "    GRAPH <http://geovistory.org/resource/shacl> { \n",
      "        ?s ?p ?o . \n",
      "        BIND(isBlank(?s) as ?s_is_blank)\n",
      "        BIND(isBlank(?o) as ?o_is_blank)\n",
      "    } \n",
      "}\n",
      "LIMIT 5000\n",
      "OFFSET 5000\n"
     ]
    }
   ],
   "source": [
    "dictio = graph_model.dump_dict(prefixes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "347169d2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'s': 'node3706',\n",
       " 'p': 'sh:class',\n",
       " 'o': 'https://sdhss.org/ontology/crm-supplement/C22',\n",
       " 's_is_blank': 'true',\n",
       " 'o_is_blank': 'false'}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dictio[-1]"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
